In [2]:
import pandas as pd
import numpy as np

# Bài 1

In [3]:
filelab2 = r"data\lab2.csv"
data = pd.read_csv(filelab2)
df = pd.DataFrame(data)
df

        name  age  gender  score
0      David   22    Male     77
1      David   24  Female     80
2      David   29     NaN     82
3      David   19  Female     99
4        NaN   24     NaN     89
..       ...  ...     ...    ...
995    Alice   29     NaN     90
996     Emma   18    Male     89
997  Charlie   26  Female     69
998  Charlie   24     NaN     65
999     Emma   21  Female     64

[1000 rows x 4 columns]

In [5]:
print(f'Tổng điểm của tất cả học sinh: {df['score'].sum()}')

Tổng điểm của tất cả học sinh: 79263

In [6]:
print(f'Tuổi trung bình của học sinh: {df['age'].median()}')

Tuổi trung bình của học sinh: 23.0

In [7]:
print(f'Học sinh có điểm số cao nhất {df['score'].max()} và thấp nhất {df['score'].min()}')

Học sinh có điểm số cao nhất 99 và thấp nhất 60

# Bài 2

In [8]:
print(f'Các học sinh có điểm số >= 80:\n{df.loc[df['score'] >= 80]}')

Các học sinh có điểm số >= 80:
      name  age  gender  score
1    David   24  Female     80
2    David   29     NaN     82
3    David   19  Female     99
4      NaN   24     NaN     89
5     Emma   19  Female     88
..     ...  ...     ...    ...
975    Bob   22  Female     92
983  David   23  Female     95
986   Emma   22    Male     90
995  Alice   29     NaN     90
996   Emma   18    Male     89

[494 rows x 4 columns]

In [9]:
print(f'Tất cả các học sinh có tuổi lớn hơn 25:\n{df.loc[df['age'] > 25]}')

Tất cả các học sinh có tuổi lớn hơn 25:
        name  age  gender  score
2      David   29     NaN     82
7        Bob   28  Female     79
9    Charlie   28     NaN     78
11   Charlie   29    Male     98
14       NaN   28    Male     60
..       ...  ...     ...    ...
988    David   28  Female     74
991    David   26     NaN     68
993    David   28  Female     60
995    Alice   29     NaN     90
997  Charlie   26  Female     69

[313 rows x 4 columns]

In [10]:
print(f'Tất cả các học sinh có tên bắt đầu bằng chữ "A"\n: { df[df['name'].notna() & df['name'].str.startswith('A')]}')

Tất cả các học sinh có tên bắt đầu bằng chữ "A"
:       name  age  gender  score
12   Alice   22  Female     97
17   Alice   20  Female     70
20   Alice   22    Male     83
25   Alice   29  Female     81
33   Alice   26    Male     90
..     ...  ...     ...    ...
971  Alice   27  Female     90
976  Alice   26     NaN     70
977  Alice   27    Male     67
990  Alice   20     NaN     79
995  Alice   29     NaN     90

[169 rows x 4 columns]

# Bài 3

In [16]:
print(f'Số giá trị còn thiếu trong mỗi cột là:')
print(f'Cột name: {df['name'].isnull().sum()}')
print(f'Cột age: {df['age'].isnull().sum()}')
print(f'Cột gender: {df['gender'].isnull().sum()}')
print(f'Cột score: {df['score'].isnull().sum()}')

Số giá trị còn thiếu trong mỗi cột là:
Cột name: 167
Cột age: 0
Cột gender: 351
Cột score: 0

In [17]:
print(f'Loại bỏ các hàng có giá trị thiếu:\n{df.dropna()}')

Loại bỏ các giá trị thiếu:
        name  age  gender  score
0      David   22    Male     77
1      David   24  Female     80
3      David   19  Female     99
5       Emma   19  Female     88
7        Bob   28  Female     79
..       ...  ...     ...    ...
993    David   28  Female     60
994     Emma   22    Male     60
996     Emma   18    Male     89
997  Charlie   26  Female     69
999     Emma   21  Female     64

[546 rows x 4 columns]

In [19]:
print(f'Loại bỏ các hàng trùng lặp:\n{df.drop_duplicates()}')

Loại bỏ các hàng trùng lặp:
        name  age  gender  score
0      David   22    Male     77
1      David   24  Female     80
2      David   29     NaN     82
3      David   19  Female     99
4        NaN   24     NaN     89
..       ...  ...     ...    ...
994     Emma   22    Male     60
995    Alice   29     NaN     90
996     Emma   18    Male     89
998  Charlie   24     NaN     65
999     Emma   21  Female     64

[941 rows x 4 columns]

In [74]:
# print(f'Tìm và loại bỏ trong cột "score" (dưới 60 và trên 100):\n{}')
a = df[(df['score'] > 70) & (df['score'] <= 100)]
a.sample(10)

        name  age  gender  score
704    David   24    Male     84
654     Emma   29  Female     75
685    David   21     NaN     76
579  Charlie   19    Male     89
408      Bob   22     NaN     76
950  Charlie   28    Male     90
657      Bob   21    Male     82
811      NaN   19  Female     81
947    Alice   23    Male     74
940      Bob   27  Female     77

# Bài 4

In [24]:
print(f'Chuyển đổi dữ liệu cột age thành int:\n{df['age'].astype('int64')}')

Chuyển đổi dữ liệu cột age thành int:
0      22
1      24
2      29
3      19
4      24
       ..
995    29
996    18
997    26
998    24
999    21
Name: age, Length: 1000, dtype: int64

In [25]:
print(f'Thay thế tất cả giá trị thiếu trong cột gender thành "Unknown":\n{df['gender'].fillna("Unknown")}')

Thay thế tất cả giá trị thiếu trong cột gender thành "Unknown":
0         Male
1       Female
2      Unknown
3       Female
4      Unknown
        ...
995    Unknown
996       Male
997     Female
998    Unknown
999     Female
Name: gender, Length: 1000, dtype: object

In [26]:
print(f'Thay thế tất cả các giá trị “na” trong cột "score" bằng giá trị trung bình:\n{df['score'].fillna(df['score'].mean())}')

Thay thế tất cả các giá trị “na” trong cột "score" bằng giá trị trung bình:
0      77
1      80
2      82
3      99
4      89
       ..
995    90
996    89
997    69
998    65
999    64
Name: score, Length: 1000, dtype: int64